import xlwings as xw
import os
import re

step_1 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置',
          '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']  ##########################################
step_2 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '搁置', '恒流放电',
          '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置']
step_3 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '搁置', '恒流恒压充电', '搁置', '恒流放电',
          '搁置', '恒流放电', '搁置'] ##########################################
step_4 = ['搁置', '恒流放电', '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置',
          '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置'] ##########################################
step_5 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置',
          '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']##########################################
step_6 = ['搁置', '恒流放电', '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']##########################################
step_7 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']##########################################
step_8 = ['搁置', '恒流放电', '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置',
          '搁置', 'CCCV充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']##########################################
step_9 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置',
          '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']##########################################
step_10 = ['搁置', '恒流放电', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置',
           '恒流放电', '搁置', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']##########################################
step_11 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置',
           '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '搁置'] ########################################## 工步不对 会复侧
step_12 = ['恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置',
           '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置'] ##########################################
step_13 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '搁置', '恒流恒压充电', '搁置', '恒流放电',
           '搁置', '恒流放电', '搁置', '恒流充电', '搁置'] ##########################################
step_14 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置']
step_15 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置',
           '恒流放电', '搁置', '恒流充电', '搁置'] ##########################################
step_16 = ['搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置'] ##########################################
step_17 = ['搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电'] ##########################################
step_18 = ['搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置'] ##########################################
step_19 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电',
           '搁置', '恒流放电', '搁置'] ##########################################
step_20 = ['搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置']

step_21 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置']  ##########################################
step_22 = ['搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电']  ##########################################
step_23 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '搁置']  ##
step_24 = ['搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置']  ##########################################
step_25 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置'] ##########################################
step_26 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']
step_27 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']
step_28 = ['搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']
step_29 = ['搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']
step_30 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置']
step_31 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '搁置', '恒流充电', '恒流充电', '搁置']
# 202307-C01721
step_32 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置']
step_33 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置']
step_34 = ['搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置']
step_35 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置']
step_36 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电']
step_37 = ['搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置']
step_38 = ['搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']
step_39 = ['搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']
step_40 = ['搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置']
step_41 = ['搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置']
step_42 = ['搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置']
step_43 = ['搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置']
step_44 = ['搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置', '恒流放电', '搁置', '恒流充电', '恒流充电', '恒流恒压充电', '搁置', '恒流放电', '搁置', '恒流放电', '搁置', '恒流充电', '搁置']

step_sum = [step_1, step_2, step_3, step_4, step_5, step_6, step_7, step_8, step_9, step_10, step_11, step_12, step_13,
            step_14, step_15, step_16, step_17, step_18, step_19, step_20, step_21, step_22, step_23, step_24, step_25, step_26,
            step_27, step_28, step_29, step_30, step_31, step_32, step_33, step_34, step_35, step_36, step_37, step_38, step_39,
            step_40, step_41, step_42, step_43, step_44]


sht = xw.sheets.active
row = sht[0:1, 0:1].expand('table').rows.count
a = xw.Range(f'E{2}:E{36}').value
print(a)

print(step_sum.index(a))

